stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_dma.h
  __IO HAL_DMA_StateTypeDef State;                                 /*!< DMA transfer state                      */

  __IO uint32_t             ErrorCode;                             /*!< DMA error code                          */

  void                      *Parent;                               /*!< Parent object state                     */

  void (* XferCpltCallback)(struct __DMA_HandleTypeDef *hdma);     /*!< DMA transfer complete callback          */

  void (* XferHalfCpltCallback)(struct __DMA_HandleTypeDef *hdma); /*!< DMA half transfer complete callback     */

  void (* XferErrorCallback)(struct __DMA_HandleTypeDef *hdma);    /*!< DMA transfer error callback             */

  void (* XferAbortCallback)(struct __DMA_HandleTypeDef *hdma);    /*!< DMA transfer Abort callback             */

  void (* XferSuspendCallback)(struct __DMA_HandleTypeDef *hdma);  /*!< DMA transfer Suspend callback           */

  struct __DMA_QListTypeDef  *LinkedListQueue;                     /*!< DMA linked-list queue                   */

} DMA_HandleTypeDef;
/**
  * @}
  */


/* Exported constants ------------------------------------------------------------------------------------------------*/
/** @defgroup DMA_Exported_Constants DMA Exported Constants
  * @brief    DMA Exported constants
  * @{
  */

/** @defgroup DMA_Error_Codes DMA Error Codes
  * @brief    DMA Error Codes
  * @{
  */
#define HAL_DMA_ERROR_NONE             (0x0000U) /*!< No error                      */
#define HAL_DMA_ERROR_DTE              (0x0001U) /*!< Data transfer error           */
#define HAL_DMA_ERROR_ULE              (0x0002U) /*!< Update linked-list item error */
#define HAL_DMA_ERROR_USE              (0x0004U) /*!< User setting error            */
#define HAL_DMA_ERROR_TO               (0x0008U) /*!< Trigger overrun error         */
#define HAL_DMA_ERROR_TIMEOUT          (0x0010U) /*!< Timeout error                 */
#define HAL_DMA_ERROR_NO_XFER          (0x0020U) /*!< No transfer ongoing error     */
#define HAL_DMA_ERROR_BUSY             (0x0040U) /*!< Busy error                    */
#define HAL_DMA_ERROR_INVALID_CALLBACK (0x0080U) /*!< Invalid callback error        */
#define HAL_DMA_ERROR_NOT_SUPPORTED    (0x0100U) /*!< Not supported mode            */
/**
  * @}
  */

/** @defgroup DMA_Interrupt_Enable_Definition DMA Interrupt Enable Definition
  * @brief    DMA Interrupt Enable Definition
  * @{
  */
#define DMA_IT_TC   DMA_CCR_TCIE   /*!< Transfer complete interrupt             */
#define DMA_IT_HT   DMA_CCR_HTIE   /*!< Half transfer complete interrupt        */
#define DMA_IT_DTE  DMA_CCR_DTEIE  /*!< Data transfer error interrupt           */
#define DMA_IT_ULE  DMA_CCR_ULEIE  /*!< Update linked-list item error interrupt */
#define DMA_IT_USE  DMA_CCR_USEIE  /*!< User eetting error interrupt            */
#define DMA_IT_SUSP DMA_CCR_SUSPIE /*!< Completed suspension interrupt          */
#define DMA_IT_TO   DMA_CCR_TOIE   /*!< Trigger overrun interrupt               */
/**
  * @}
  */

/** @defgroup DMA_Flag_Definition DMA Flag Definition
  * @brief    DMA Flag Definition
  * @{
  */
#define DMA_FLAG_IDLE DMA_CSR_IDLEF /*!< Idle flag                          */
#define DMA_FLAG_TC   DMA_CSR_TCF   /*!< Transfer complete flag             */
#define DMA_FLAG_HT   DMA_CSR_HTF   /*!< Half transfer complete flag        */
#define DMA_FLAG_DTE  DMA_CSR_DTEF  /*!< Data transfer error flag           */
#define DMA_FLAG_ULE  DMA_CSR_ULEF  /*!< Update linked-list item error flag */
#define DMA_FLAG_USE  DMA_CSR_USEF  /*!< User setting error flag            */
#define DMA_FLAG_SUSP DMA_CSR_SUSPF /*!< Completed suspension flag          */
#define DMA_FLAG_TO   DMA_CSR_TOF   /*!< Trigger overrun flag               */
/**
  * @}
  */

/** @defgroup DMA_Request_Selection DMA Request Selection
  * @brief    DMA Request Selection
  * @{
  */
/* GPDMA1 Hardware Requests */
#define GPDMA1_REQUEST_ADC1         0U     /*!< GPDMA1 HW request is ADC1         */
#define GPDMA1_REQUEST_ADC2         1U     /*!< GPDMA1 HW request is ADC2         */
#define GPDMA1_REQUEST_DAC1_CH1     2U     /*!< GPDMA1 HW request is DAC1_CH1     */
#define GPDMA1_REQUEST_DAC1_CH2     3U     /*!< GPDMA1 HW request is DAC1_CH2     */
#define GPDMA1_REQUEST_TIM6_UP      4U     /*!< GPDMA1 HW request is TIM6_UP      */
#define GPDMA1_REQUEST_TIM7_UP      5U     /*!< GPDMA1 HW request is TIM7_UP      */
#define GPDMA1_REQUEST_SPI1_RX      6U     /*!< GPDMA1 HW request is SPI1_RX      */
#define GPDMA1_REQUEST_SPI1_TX      7U     /*!< GPDMA1 HW request is SPI1_TX      */
#define GPDMA1_REQUEST_SPI2_RX      8U     /*!< GPDMA1 HW request is SPI2_RX      */
#define GPDMA1_REQUEST_SPI2_TX      9U     /*!< GPDMA1 HW request is SPI2_TX      */
#define GPDMA1_REQUEST_SPI3_RX      10U    /*!< GPDMA1 HW request is SPI3_RX      */
#define GPDMA1_REQUEST_SPI3_TX      11U    /*!< GPDMA1 HW request is SPI3_TX      */
#define GPDMA1_REQUEST_I2C1_RX      12U    /*!< GPDMA1 HW request is I2C1_RX      */
#define GPDMA1_REQUEST_I2C1_TX      13U    /*!< GPDMA1 HW request is I2C1_TX      */
#define GPDMA1_REQUEST_I2C1_EVC     14U    /*!< GPDMA1 HW request is I2C1_EVC     */
#if defined (I2C2)
#define GPDMA1_REQUEST_I2C2_RX      15U    /*!< GPDMA1 HW request is I2C2_RX      */
#define GPDMA1_REQUEST_I2C2_TX      16U    /*!< GPDMA1 HW request is I2C2_TX      */
#define GPDMA1_REQUEST_I2C2_EVC     17U    /*!< GPDMA1 HW request is I2C2_EVC     */
#endif /* I2C2 */
#define GPDMA1_REQUEST_I2C3_RX      18U    /*!< GPDMA1 HW request is I2C3_RX      */
#define GPDMA1_REQUEST_I2C3_TX      19U    /*!< GPDMA1 HW request is I2C3_TX      */
#define GPDMA1_REQUEST_I2C3_EVC     20U    /*!< GPDMA1 HW request is I2C3_EVC     */
#if defined (I2C4)
#define GPDMA1_REQUEST_I2C4_RX      21U    /*!< GPDMA1 HW request is I2C4_RX      */
#define GPDMA1_REQUEST_I2C4_TX      22U    /*!< GPDMA1 HW request is I2C4_TX      */
#define GPDMA1_REQUEST_I2C4_EVC     23U    /*!< GPDMA1 HW request is I2C4_EVC     */
#endif /* I2C4 */
#define GPDMA1_REQUEST_USART1_RX    24U    /*!< GPDMA1 HW request is USART1_RX    */
#define GPDMA1_REQUEST_USART1_TX    25U    /*!< GPDMA1 HW request is USART1_TX    */
#if defined (USART2)
#define GPDMA1_REQUEST_USART2_RX    26U    /*!< GPDMA1 HW request is USART2_RX    */
#define GPDMA1_REQUEST_USART2_TX    27U    /*!< GPDMA1 HW request is USART2_TX    */
#endif /* USART2 */
#define GPDMA1_REQUEST_USART3_RX    28U    /*!< GPDMA1 HW request is USART3_RX    */
#define GPDMA1_REQUEST_USART3_TX    29U    /*!< GPDMA1 HW request is USART3_TX    */
#define GPDMA1_REQUEST_UART4_RX     30U    /*!< GPDMA1 HW request is UART4_RX     */
#define GPDMA1_REQUEST_UART4_TX     31U    /*!< GPDMA1 HW request is UART4_TX     */
#define GPDMA1_REQUEST_UART5_RX     32U    /*!< GPDMA1 HW request is UART5_RX     */
#define GPDMA1_REQUEST_UART5_TX     33U    /*!< GPDMA1 HW request is UART5_TX     */
#define GPDMA1_REQUEST_LPUART1_RX   34U    /*!< GPDMA1 HW request is LPUART1_RX   */
#define GPDMA1_REQUEST_LPUART1_TX   35U    /*!< GPDMA1 HW request is LPUART1_TX   */
#if defined (SAI1)
#define GPDMA1_REQUEST_SAI1_A       36U    /*!< GPDMA1 HW request is SAI1_A       */
#define GPDMA1_REQUEST_SAI1_B       37U    /*!< GPDMA1 HW request is SAI1_B       */
#endif /* SAI1 */
/*  Reserved                        38U                                           */
/*  Reserved                        39U                                           */
#define GPDMA1_REQUEST_OCTOSPI1     40U    /*!< GPDMA1 HW request is OCTOSPI1     */
/*  Reserved                        41U                                           */
#define GPDMA1_REQUEST_TIM1_CH1     42U    /*!< GPDMA1 HW request is TIM1_CH1     */
#define GPDMA1_REQUEST_TIM1_CH2     43U    /*!< GPDMA1 HW request is TIM1_CH2     */
#define GPDMA1_REQUEST_TIM1_CH3     44U    /*!< GPDMA1 HW request is TIM1_CH3     */
#define GPDMA1_REQUEST_TIM1_CH4     45U    /*!< GPDMA1 HW request is TIM1_CH4     */
#define GPDMA1_REQUEST_TIM1_UP      46U    /*!< GPDMA1 HW request is TIM1_UP      */
#define GPDMA1_REQUEST_TIM1_TRIG    47U    /*!< GPDMA1 HW request is TIM1_TRIG    */
#define GPDMA1_REQUEST_TIM1_COM     48U    /*!< GPDMA1 HW request is TIM1_COM     */
#define GPDMA1_REQUEST_I3C1_RX      49U    /*!< GPDMA1 HW request is I3C1_RX      */
#define GPDMA1_REQUEST_I3C1_TX      50U    /*!< GPDMA1 HW request is I3C1_TX      */
#define GPDMA1_REQUEST_I3C1_TC      51U    /*!< GPDMA1 HW request is I3C1_TC      */
#define GPDMA1_REQUEST_I3C1_RS      52U    /*!< GPDMA1 HW request is I3C1_RS      */
/*  Reserved                        53U                                           */
/*  Reserved                        54U                                           */
/*  Reserved                        55U                                           */
#define GPDMA1_REQUEST_TIM2_CH1     56U    /*!< GPDMA1 HW request is TIM2_CH1     */
#define GPDMA1_REQUEST_TIM2_CH2     57U    /*!< GPDMA1 HW request is TIM2_CH2     */
#define GPDMA1_REQUEST_TIM2_CH3     58U    /*!< GPDMA1 HW request is TIM2_CH3     */
#define GPDMA1_REQUEST_TIM2_CH4     59U    /*!< GPDMA1 HW request is TIM2_CH4     */
#define GPDMA1_REQUEST_TIM2_UP      60U    /*!< GPDMA1 HW request is TIM2_UP      */
#define GPDMA1_REQUEST_TIM3_CH1     61U    /*!< GPDMA1 HW request is TIM3_CH1     */
#define GPDMA1_REQUEST_TIM3_CH2     62U    /*!< GPDMA1 HW request is TIM3_CH2     */
#define GPDMA1_REQUEST_TIM3_CH3     63U    /*!< GPDMA1 HW request is TIM3_CH3     */
#define GPDMA1_REQUEST_TIM3_CH4     64U    /*!< GPDMA1 HW request is TIM3_CH4     */
#define GPDMA1_REQUEST_TIM3_UP      65U    /*!< GPDMA1 HW request is TIM3_UP      */
#define GPDMA1_REQUEST_TIM3_TRIG    66U    /*!< GPDMA1 HW request is TIM3_TRIG    */
#define GPDMA1_REQUEST_TIM4_CH1     67U    /*!< GPDMA1 HW request is TIM4_CH1     */
#define GPDMA1_REQUEST_TIM4_CH2     68U    /*!< GPDMA1 HW request is TIM4_CH2     */
#define GPDMA1_REQUEST_TIM4_CH3     69U    /*!< GPDMA1 HW request is TIM4_CH3     */
#define GPDMA1_REQUEST_TIM4_CH4     70U    /*!< GPDMA1 HW request is TIM4_CH4     */
#define GPDMA1_REQUEST_TIM4_UP      71U    /*!< GPDMA1 HW request is TIM4_UP      */
#if defined (I3C2)
#define GPDMA1_REQUEST_I3C2_RX      72U    /*!< GPDMA1 HW request is I3C2_RX      */
#define GPDMA1_REQUEST_I3C2_TX      73U    /*!< GPDMA1 HW request is I3C2_TX      */
#define GPDMA1_REQUEST_I3C2_TC      74U    /*!< GPDMA1 HW request is I3C2_TC      */
#define GPDMA1_REQUEST_I3C2_RS      75U    /*!< GPDMA1 HW request is I3C2_RS      */
#endif /* I3C2 */
#if defined (SPI4)
#define GPDMA1_REQUEST_SPI4_RX      76U    /*!< GPDMA1 HW request is SPI4_RX      */
#define GPDMA1_REQUEST_SPI4_TX      77U    /*!< GPDMA1 HW request is SPI4_TX      */
#endif /* SPI4 */
#define GPDMA1_REQUEST_TIM15_CH1    78U    /*!< GPDMA1 HW request is TIM15_CH1    */
#define GPDMA1_REQUEST_TIM15_UP     79U    /*!< GPDMA1 HW request is TIM15_UP     */
#define GPDMA1_REQUEST_TIM15_TRIG   80U    /*!< GPDMA1 HW request is TIM15_TRIG   */
#define GPDMA1_REQUEST_TIM15_COM    81U    /*!< GPDMA1 HW request is TIM15_COM    */
#define GPDMA1_REQUEST_TIM16_CH1    82U    /*!< GPDMA1 HW request is TIM16_CH1    */
#define GPDMA1_REQUEST_TIM16_UP     83U    /*!< GPDMA1 HW request is TIM16_UP     */
#define GPDMA1_REQUEST_TIM17_CH1    84U    /*!< GPDMA1 HW request is TIM17_CH1    */
#define GPDMA1_REQUEST_TIM17_UP     85U    /*!< GPDMA1 HW request is TIM17_UP     */
/*  Reserved                        86U                                           */
#define GPDMA1_REQUEST_AES_IN       87U    /*!< GPDMA1 HW request is AES_IN       */
#define GPDMA1_REQUEST_AES_OUT      88U    /*!< GPDMA1 HW request is AES_OUT      */
#define GPDMA1_REQUEST_HASH_IN      89U    /*!< GPDMA1 HW request is HASH_IN      */
/*  Reserved                        90U                                           */
#if defined (TIM8)
#define GPDMA1_REQUEST_TIM8_CH1     91U    /*!< GPDMA1 HW request is TIM8_CH1     */
#define GPDMA1_REQUEST_TIM8_CH2     92U    /*!< GPDMA1 HW request is TIM8_CH2     */
#define GPDMA1_REQUEST_TIM8_CH3     93U    /*!< GPDMA1 HW request is TIM8_CH3     */
#define GPDMA1_REQUEST_TIM8_CH4     94U    /*!< GPDMA1 HW request is TIM8_CH4     */
#define GPDMA1_REQUEST_TIM8_UP      95U    /*!< GPDMA1 HW request is TIM8_UP      */
#define GPDMA1_REQUEST_TIM8_TRIG    96U    /*!< GPDMA1 HW request is TIM8_TRIG    */
#define GPDMA1_REQUEST_TIM8_COM     97U    /*!< GPDMA1 HW request is TIM8_COM     */
#endif /* TIM8 */
#if defined (ADF1)
#define GPDMA1_REQUEST_ADF1_FLT0    98U    /*!< GPDMA1 HW request is ADF1_FLT0    */
#endif /* ADF1 */
/*  Reserved                        99U                                           */
/*  Reserved                        100U                                          */
/*  Reserved                        101U                                          */
/*  Reserved                        102U                                          */
#define GPDMA1_REQUEST_SAES_IN      103U   /*!< GPDMA1 HW request is SAES_IN      */
#define GPDMA1_REQUEST_SAES_OUT     104U   /*!< GPDMA1 HW request is SAES_OUT     */
#define GPDMA1_REQUEST_LPTIM1_IC1   105U   /*!< GPDMA1 HW request is LPTIM1_IC1   */
#define GPDMA1_REQUEST_LPTIM1_IC2   106U   /*!< GPDMA1 HW request is LPTIM1_IC2   */
#define GPDMA1_REQUEST_LPTIM1_UE    107U   /*!< GPDMA1 HW request is LPTIM1_UE    */
#define GPDMA1_REQUEST_LPTIM2_IC1   108U   /*!< GPDMA1 HW request is LPTIM2_IC1   */
#define GPDMA1_REQUEST_LPTIM2_IC2   109U   /*!< GPDMA1 HW request is LPTIM2_IC2   */
#define GPDMA1_REQUEST_LPTIM2_UE    110U   /*!< GPDMA1 HW request is LPTIM2_UE    */
#define GPDMA1_REQUEST_LPTIM3_IC1   111U   /*!< GPDMA1 HW request is LPTIM3_IC1   */
#define GPDMA1_REQUEST_LPTIM3_IC2   112U   /*!< GPDMA1 HW request is LPTIM3_IC2   */
#define GPDMA1_REQUEST_LPTIM3_UE    113U   /*!< GPDMA1 HW request is LPTIM3_UE    */

/* Software request */
#define DMA_REQUEST_SW              DMA_CTR2_SWREQ /*!< DMA SW request            */
/**
  * @}
  */

